# ZJust Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..ZJust Property
StructuralElementDefinitionData Class See Also
---
Z justification (ref axis).
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ZJustification ZJust { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ZJust As ZJustification
	Get
```

Visual C++
---
```text
public:
property ZJustification ZJust {
	ZJustification get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace